/*Напишите программу, вычисляющую среднее арифме-
тическое двух чисел.*/

#include <iostream>
using namespace std;
void main()
{
	cout << "input a=";
	float a;
	cin >> a;
	cout << "input b=";
	float b;
	cin >> b;
	cout << "Result :" << (a + b) / 2 << "\n";
}
