#include <iostream>
using namespace std;

void main_4()
{
	int h = 15;
	int w = 15;

/*	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (i == 0 || j == 0 || i == h - 1 || j == w - 1 ||
				i == j || i == w - 1 - j || j == w / 2 || i == h / 2)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
*/


	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
				//i == 0 //верх горизонт
				j == 0 //лев верт
				|| i == h - 1 //низ горизонт
				//|| j == w - 1 //прав верт
				|| i == j // диог верх лев прав
				//|| i == w - 1 - j //диаг верх прав низ лев
				//|| j == w / 2 //центр верт
				//|| i == h / 2 //цнтр горонт

				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
//------------------------------------------------------------------------

	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
				i == 0 //верх горизонт
					   //				|| j == 0 //лев верт
					   //				|| i == h - 1 //низ горизонт
				|| j == w - 1 //прав верт
				|| i == j // диог верх лев прав
						  //				|| i == w - 1 - j //диаг верх прав низ лев
						  //				|| j == w / 2 //центр верт
						  //				|| i == h / 2 //цнтр горонт

				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
//------------------------------------------------------------------------


	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
//				i == 0 //верх горизонт
//				|| j == 0 //лев верт
				i == h - 1 //низ горизонт
				|| j == w - 1 //прав верт
//				|| i == j // диог верх лев прав
				|| i == w - 1 - j //диаг верх прав низ лев
 //				|| j == w / 2 //центр верт
 //				|| i == h / 2 //цнтр горонт

				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
	//------------------------------------------------------------------------

	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
				i == 0 //верх горизонт
				|| j == 0 //лев верт
 //				|| i == h - 1 //низ горизонт
//				|| j == w - 1 //прав верт
//				|| i == j // диог верх лев прав
				|| i == w - 1 - j //диаг верх прав низ лев
//				|| j == w / 2 //центр верт
 //				|| i == h / 2 //цнтр горонт

				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
	//------------------------------------------------------------------------


	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
				i == 0 //верх горизонт
 				|| i == 2*j //прав верт
				|| i == 2*(w-1-j) // диог верх лев прав
				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
	//------------------------------------------------------------------------


	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (
								//i == 10 //верх горизонт
								 //j == i //лев верт
				i == h - 1 //низ горизонт
				//				|| j == w - 1 //прав верт
				|| 2*j == w-1-i 
				|| 2*j == w-1+i
				//2*i == w/2 + j// диог верх лев прав
				//				|| i == w - 1 - j //диаг верх прав низ лев
				//				|| j == w / 2 //центр верт
				//i == h / 2 || i == h / 2 + j
				//|| i == h / 2 - j
				//|| j == w / 2 + i
				//|| j == w / 2 - i + w - 1//цнтр горонт

				)
			{
				cout << "* ";
			}
			else
			{
				cout << "  ";
			}
		}

		cout << endl;
	}

	cout << endl << endl;
	//------------------------------------------------------------------------

	for (int i = 0; i < h; i++)
	{
		for (int j = 0; j < w; j++)
		{
			if (i == j + h/2 || i == w - 1 - j + h/2 ||
				i >= j - h/2 && i >= w - 1 -j - h/2 && i <= h/2)
			{
				cout << "*";
			}
			else
			{
				cout << " ";
			}
		}
		cout << endl << endl;
	}

	
}